In [1]:
import os
import pandas as pd
import numpy as np

In [2]:
os.chdir("D:\Jupyter Codes")

In [3]:
cars_data = pd.read_csv('toyota.csv', index_col = 0)

In [4]:
cars_data

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
Index,,,,,,,,,,
0,13500,23,46986,Diesel,90,1.0,0,2000,three,1165
1,13750,23,72937,Diesel,90,1.0,0,2000,3,1165
2,13950,24,41711,Diesel,90,NaN,0,2000,3,1165

In [8]:
cars_data1 = cars_data.copy(deep = True)

In [10]:
cars_data1.index

Index([0, 1, 2], dtype='int64', name='Index')

In [11]:
cars_data1.columns

Index(['Price', 'Age', 'KM', 'FuelType', 'HP', 'MetColor', 'Automatic', 'CC',
       'Doors', 'Weight'],
      dtype='object')

In [12]:
cars_data1.size

30

In [13]:
cars_data1.shape

(3, 10)

In [14]:
cars_data1.memory_usage()

Index        24
Price        24
Age          24
KM           24
FuelType     24
HP           24
MetColor     24
Automatic    24
CC           24
Doors        24
Weight       24
dtype: int64

In [16]:
cars_data1.ndim

2

In [19]:
cars_data1.head(6) #returns first n rows from the dataframe

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
Index,,,,,,,,,,
0,13500,23,46986,Diesel,90,1.0,0,2000,three,1165
1,13750,23,72937,Diesel,90,1.0,0,2000,3,1165
2,13950,24,41711,Diesel,90,NaN,0,2000,3,1165

In [21]:
cars_data1.tail(5)

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
Index,,,,,,,,,,
0,13500,23,46986,Diesel,90,1.0,0,2000,three,1165
1,13750,23,72937,Diesel,90,1.0,0,2000,3,1165
2,13950,24,41711,Diesel,90,NaN,0,2000,3,1165

In [22]:
cars_data1.at[2,'FuelType']

'Diesel'

In [23]:
cars_data1.at[2,'KM']

41711

In [26]:
cars_data1.iat[2,4]

90

In [27]:
cars_data1.loc[:,'Doors']

Index
0    three
1        3
2        3
Name: Doors, dtype: object

In [28]:
data = pd.read_csv('iris.csv')

In [29]:
data

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica